__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, None, 111)    0                                            
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) [(None, 512), (None, 753664      input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, None, 113)    0                                            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 512)          0           bidirectional_1[0][1]            
                                                                 bidirectional_1[0][3]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 512)          0           bidirectional_1[0][2]            
                                                                 bidirectional_1[0][4]            
__________________________________________________________________________________________________
lstm_2 (LSTM)                   [(None, None, 512),  1282048     input_2[0][0]                    
                                                                 concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, None, 113)    57969       lstm_2[0][0]                     
==================================================================================================
Total params: 2,093,681
Trainable params: 2,093,681
Non-trainable params: 0
__________________________________________________________________________________________________